aneesh-pradhan/rp2350-fsr/fsr_usbserial_rp2350.ino
#include <inttypes.h>
#include <EEPROM.h>

#if !defined(__AVR_ATmega32U4__) && !defined(__AVR_ATmega328P__) && \
    !defined(__AVR_ATmega1280__) && !defined(__AVR_ATmega2560__)
  #define CAN_AVERAGE
#endif

#if defined(_SFR_BYTE) && defined(_BV) && defined(ADCSRA)
  #define CLEAR_BIT(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit))
  #define SET_BIT(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))
#endif

// To enable joystick support on Atmega32u4 boards such as a Leonardo or Pro Micro,
// install Arduino Joystick Library from
// https://github.com/MHeironimus/ArduinoJoystickLibrary/tree/master#installation-instructions
// then uncomment the following line.
// #define USE_ARDUINO_JOYSTICK_LIBRARY

#if defined(CORE_TEENSY)
  // Use the Joystick library for Teensy
  void ButtonStart() {
    // Use Joystick.begin() for everything that's not Teensy 2.0.
    #ifndef __AVR_ATmega32U4__
      Joystick.begin();
    #endif
    Joystick.useManualSend(true);
  }
  void ButtonPress(uint8_t button_num) {
    Joystick.button(button_num, 1);
  }
  void ButtonRelease(uint8_t button_num) {
    Joystick.button(button_num, 0);
  }
  bool ButtonSend() {
    Joystick.send_now();
    return true;
  }
#elif defined(ARDUINO_ARCH_RP2040) || defined(PICO_BOARD)
  // Use the Joystick library for Arduino-Pico
  // Teensy includes Joystick by default but Arduino-Pico requires
  // it to be included explicitly. The API is similar but it
  // is a different implementation with its own quirks.
  // Make sure to select Pico SDK for the Arduino-Pico USB stack.
  #include <Joystick.h>
  // Include tusb.h to get tud_hid_ready()
  #include "tusb.h"
  // Arduino-Pico defaults to 10ms polling interval (100Hz) but it can be
  // set to a shorter interval by declaring a usb_hid_poll_interval global.
  // Set the interval to 1 for 1000Hz polling. Requires Arduino-Pico 3.6.1
  // or newer to work. Older versions will always request a 10ms interval.
  int usb_hid_poll_interval = 1;
  void ButtonStart() {
    Joystick.begin();
    Joystick.useManualSend(true);
  }
  void ButtonPress(uint8_t button_num) {
    Joystick.button(button_num, 1);
  }
  void ButtonRelease(uint8_t button_num) {
    Joystick.button(button_num, 0);
  }
  bool ButtonSend() {
    // Wait until send_now can send with minimal delay.
    // If it isn't ready, Joystick.send_now() will block.
    // Problems are most pronounced at slower polling rates since
    // send_now() could block for a full polling interval.
    if (!tud_hid_ready()) {
      return false;
    } else {
      Joystick.send_now();
      return true;
    }
  }
#elif defined(USE_ARDUINO_JOYSTICK_LIBRARY)
  #include <Joystick.h>
  // Create the Joystick
  Joystick_ Joystick;
  void ButtonStart() {
    // Passing false disables autosend.
    Joystick.begin(false);
  }
  void ButtonPress(uint8_t button_num) {
    Joystick.pressButton(button_num);
  }
  void ButtonRelease(uint8_t button_num) {
    Joystick.releaseButton(button_num);
  }
  bool ButtonSend() {
    Joystick.sendState();
    return true;
  }
#else
  #include <Keyboard.h>
  // And the Keyboard library for Arduino
  void ButtonStart() {
    Keyboard.begin();
  }
  void ButtonPress(uint8_t button_num) {
    Keyboard.press('a' + button_num - 1);
  }
  void ButtonRelease(uint8_t button_num) {
    Keyboard.release('a' + button_num - 1);
  }
  bool ButtonSend() {
    // Keyboard doesn't use manual send, but report success anyway.
    return true;
  }
#endif

// Default threshold value for each of the sensors.
const int16_t kDefaultThreshold = 1000;
// Max window size for both of the moving averages classes.
const size_t kWindowSize = 50;
// Baud rate used for Serial communication. Technically ignored by Teensys.
const long kBaudRate = 115200;
// Max number of sensors per panel.
// NOTE(teejusb): This is arbitrary, if you need to support more sensors
// per panel then just change the following number.
const size_t kMaxSharedSensors = 2;
// Button numbers should start with 1 (Button0 is not a valid Joystick input).
// Automatically incremented when creating a new SensorState.
uint8_t curButtonNum = 1;

/*===========================================================================*/

// EXPERIMENTAL. Used to turn on the lights feature. Note, this might conflict
// some existing sensor pins so if you see some weird behavior it might be
// because of this. Uncomment the following line to enable the feature.

// #define ENABLE_LIGHTS

// We don't want to use digital pins 0 and 1 as they're needed for Serial
// communication so we start curLightPin from 2.
// Automatically incremented when creating a new SensorState.
#if defined(ENABLE_LIGHTS)
  uint8_t curLightPin = 2;
#endif

/*===========================================================================*/

// Calculates the Weighted Moving Average for a given period size.
// Values provided to this class should fall in [−32,768, 32,767] otherwise it
// may overflow. We use a 32-bit integer for the intermediate sums which we
// then restrict back down to 16-bits.
class WeightedMovingAverage {
 public:
  WeightedMovingAverage(size_t size) :
      size_(min(size, kWindowSize)), cur_sum_(0), cur_weighted_sum_(0),
      values_{}, cur_count_(0) {}

  int16_t GetAverage(int16_t value) {
    // Add current value and remove oldest value.
    // e.g. with value = 5 and cur_count_ = 0
    // [4, 3, 2, 1] -> 10 becomes 10 + 5 - 4 = 11 -> [5, 3, 2, 1]
    int32_t next_sum = cur_sum_ + value - values_[cur_count_];
    // Update weighted sum giving most weight to the newest value.
    // [1*4, 2*3, 3*2, 4*1] -> 20 becomes 20 + 4*5 - 10 = 30
    //     -> [4*5, 1*3, 2*2, 3*1]
    // Subtracting by cur_sum_ is the same as removing 1 from each of the weight
    // coefficients.
    int32_t next_weighted_sum = cur_weighted_sum_ + size_ * value - cur_sum_;
    cur_sum_ = next_sum;
    cur_weighted_sum_ = next_weighted_sum;
    values_[cur_count_] = value;
    cur_count_ = (cur_count_ + 1) % size_;
    // Integer division is fine here since both the numerator and denominator
    // are integers and we need to return an int anyways. Off by one isn't
    // substantial here.
    // Sum of weights = sum of all integers from [1, size_]
    int16_t sum_weights = ((size_ * (size_ + 1)) / 2);
    return next_weighted_sum/sum_weights;
  }

  // Delete default constructor. Size MUST be explicitly specified.
  WeightedMovingAverage() = delete;

