aneesh-pradhan/rp2350-fsr/fsr_usbserial_rp2350.ino
  private:
    size_t SaveSlotSizeBytes() {
      // +1 for the fake marker sensor, *2 because int16_t
      return (kNumSensors + 1) * 2;
    }

    int LastSaveSlot() {
      // -1 because it's the last VALID index.
      return (EEPROM.length() / SaveSlotSizeBytes()) - 1;
    }

    void SaveThreshold(
        int save_slot, size_t sensor_idx, int16_t threshold) {
      size_t offset = save_slot * SaveSlotSizeBytes();
      uint8_t b1 = (threshold & 0xFF);
      uint8_t b2 = (threshold >> 8);
      EEPROM.write(offset + sensor_idx * 2,     b1);
      EEPROM.write(offset + sensor_idx * 2 + 1, b2);
    }

    int16_t ReadThreshold(int save_slot, size_t sensor_idx) {
      size_t offset = save_slot * SaveSlotSizeBytes();
      uint8_t b1 = EEPROM.read(offset + sensor_idx * 2);
      uint8_t b2 = EEPROM.read(offset + sensor_idx * 2 + 1);
      return (b2 << 8) | b1;
    }

    void MarkSlotTaken(int save_slot, bool is_taken) {
      SaveThreshold(
          save_slot, kNumSensors, is_taken ? SAVE_SLOT_TAKEN_MARKER : 0);
    }

    bool IsSlotTaken(int save_slot) {
      return ReadThreshold(save_slot, kNumSensors) == SAVE_SLOT_TAKEN_MARKER;
    }

    void FindLastUsedSaveSlot() {
      for (int save_slot = LastSaveSlot(); save_slot >= 0 ; --save_slot) {
        if (IsSlotTaken(save_slot)){
          last_used_save_slot_ = save_slot;
          return;
        }
      }
      last_used_save_slot_ = -1;
    }

    void RestoreThreshold(size_t sensor_idx) {
      kSensors[sensor_idx].UpdateThreshold(
          ReadThreshold(last_used_save_slot_, sensor_idx));
    }

    void SaveThresholdsInSlot(int save_slot) {
      for (size_t sensor_idx = 0; sensor_idx < kNumSensors; ++sensor_idx) {
        SaveThreshold(
            save_slot, sensor_idx, kSensors[sensor_idx].GetThreshold());
      }
      MarkSlotTaken(save_slot, true);
    }

    // Any negative number would do, as actual thresholds are >=0.
    const int16_t SAVE_SLOT_TAKEN_MARKER = -42;
    int last_used_save_slot_;
};

class SerialProcessor {
 public:
   void Init(long baud_rate) {
    Serial.begin(baud_rate);
  }

  void CheckAndMaybeProcessData() {
    if (!Serial.available()) { return; }

    char cmd = Serial.read();

    // USB CDC (RP2040/RP2350): avoid blocking reads or newline-dependent parsing.
    // Process a single command byte and never wait for more data.
    switch (cmd) {
      case 'o':
      case 'O':
        UpdateOffsets();
        // Flush any leftover bytes (e.g. line endings) so they don't become commands.
        while (Serial.available()) { Serial.read(); }
        break;
      case 'v':
      case 'V':
        PrintValues();
        while (Serial.available()) { Serial.read(); }
        break;
      case 't':
      case 'T':
        PrintThresholds();
        while (Serial.available()) { Serial.read(); }
        break;
      case 's':
      case 'S':
        eeprom_processor_.SaveThresholds();
        while (Serial.available()) { Serial.read(); }
        break;
      case '0' ... '9': // Case ranges are non-standard but work in gcc.
        ReadThresholdCommand(cmd);
        break;
      default:
        // Unknown command: flush leftovers and ignore.
        while (Serial.available()) { Serial.read(); }
        break;
    }
  }

  void ReadThresholdCommand(char first_char) {
  buffer_[0] = first_char;
  size_t idx = 1;

  unsigned long start = millis();
  while ((millis() - start) < 10 && idx < kBufferSize - 1) {
    if (Serial.available()) {
      char c = Serial.read();
      if (c == '\n' || c == '\r') {
        break;
      }
      buffer_[idx++] = c;
    }
  }
  buffer_[idx] = '\0';

  char* next = nullptr;
  size_t sensor_index = strtoul(buffer_, &next, 10);
  if (sensor_index >= kNumSensors) {
    return;
  }

  int16_t sensor_threshold = strtol(next, nullptr, 10);
  if (sensor_threshold < 0 || sensor_threshold > 1023) {
    return;
  }

  kSensors[sensor_index].UpdateThreshold(sensor_threshold);
  PrintThresholds();
}

  void UpdateAndPrintThreshold(size_t bytes_read) {
    // Need to specify:
    // Sensor number + Threshold value, separated by a space.
    // {0, 1, 2, 3,...} + "0"-"1023"
    // e.g. 3 180 (fourth FSR, change threshold to 180)
    
    if (bytes_read < 3 || bytes_read > 7) { return; }

    char* next = nullptr;
    size_t sensor_index = strtoul(buffer_, &next, 10);
    if (sensor_index >= kNumSensors) { return; }

    int16_t sensor_threshold = strtol(next, nullptr, 10);
    if (sensor_threshold < 0 || sensor_threshold > 1023) { return; }

    kSensors[sensor_index].UpdateThreshold(sensor_threshold);
    PrintThresholds();
  }

  void UpdateOffsets() {
    for (size_t i = 0; i < kNumSensors; ++i) {
      kSensors[i].UpdateOffset();
    }
  }

  void PrintValues() {
    Serial.print("v");
    for (size_t i = 0; i < kNumSensors; ++i) {
      Serial.print(" ");
      Serial.print(kSensors[i].GetCurValue());
    }
    Serial.print("\n");
  }

  void PrintThresholds() {
    Serial.print("t");
    for (size_t i = 0; i < kNumSensors; ++i) {
      Serial.print(" ");
      Serial.print(kSensors[i].GetThreshold());
    }
    Serial.print("\n");
  }

  void LoadThresholdsFromEeprom() {
    eeprom_processor_.LoadThresholds();
  }

 private:
   static const size_t kBufferSize = 64;
   char buffer_[kBufferSize];

   EepromProcessor eeprom_processor_;
};

/*===========================================================================*/

SerialProcessor serialProcessor;
// Timestamps are always "unsigned long" regardless of board type So don't need
// to explicitly worry about the widths.
unsigned long lastSend = 0;
// loopTime is used to estimate how long it takes to run one iteration of
// loop().
long loopTime = -1;

void setup() {
  serialProcessor.Init(kBaudRate);
  ButtonStart();
  for (size_t i = 0; i < kNumSensors; ++i) {
    // Button numbers should start with 1.
    kSensors[i].Init(i + 1);
  }
  
  serialProcessor.LoadThresholdsFromEeprom();

  #if defined(CLEAR_BIT) && defined(SET_BIT)
	  // Set the ADC prescaler to 16 for boards that support it,
	  // which is a good balance between speed and accuracy.
	  // More information can be found here: http://www.gammon.com.au/adc
	  SET_BIT(ADCSRA, ADPS2);
	  CLEAR_BIT(ADCSRA, ADPS1);
	  CLEAR_BIT(ADCSRA, ADPS0);
  #endif
}

void loop() {
  unsigned long startMicros = micros();
  // We only want to send over USB every millisecond, but we still want to
  // read the analog values as fast as we can to have the most up to date
  // values for the average.
  static bool willSend;
  // Separate out the initialization and the update steps for willSend.
  // Since willSend is static, we want to make sure we update the variable
  // every time we loop.
  willSend = (loopTime == -1 || startMicros - lastSend + loopTime >= 1000);

  serialProcessor.CheckAndMaybeProcessData();

  for (size_t i = 0; i < kNumSensors; ++i) {
    kSensors[i].EvaluateSensor(willSend);
  }

  if (willSend) {
    bool sent = ButtonSend();
    if (sent) {
      lastSend = startMicros;
    }
  }

  if (loopTime == -1) {
    loopTime = micros() - startMicros;
  }
}
